---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyType
source: html/3463b8a3-5c87-63c0-03d1-a20e442f6f28.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyType

Enumerated type listing the type of asset property

## Syntax (C#)
```csharp
public enum AssetPropertyType
```